cases/flowThrough_s1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters   0.001;

vertices
(
    (0 0 0)
    (0.5 0 0)
    (0.5 0.5 0)
    (0 0.5 0)
    (0 0 5)
    (0.5 0 5)
    (0.5 0.5 5)
    (0 0.5 5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 10 100) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    top
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }

    bottom
    {
        type wall;
        faces
        (

            (1 5 4 0)
        );
    }

    front
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }

    back
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }
);
// ************************************************************************* //
